#**Data Normalization (part 1)**

#**Normalizing & Scaling data**

This lesson is about preparing your data so that machine learning algorithms can be more accurate and efficient. We will discuss various techniques that all fall under the categories of data standardization, cleaning, scaling, etc. We'll use the umbrella term normalization. Although even that term means something different when talking about vector normalization.

The overall goal of data normalization is about reducing redundancy and improving accuracy and integrity of the data and for any techniques that will use the data. The process of normalizing has its roots in relational databases where the goal is to restructure the tables and relationships to get them into 'normal' form to reduce data redundancy.

#**Different Data Types, different techniques**


![](https://drive.google.com/uc?export=view&id=1UvAkd0P4H_lLomxN3qQwsHOpE5VzcWRV)

You learned about the different ways to classify data in the previous class; this lesson is looking at data at more granular level. Although all data is essentially grouped binary values (bits on or off), we will look at how to manage some of the most common categories in data- science including text, numeric, and categorical (a mix of text and numbers).

Data normalization can be done just about any kind of data including audio, image, text, numeric, and categorical data. We will go over some of the basic strategies for handling several of these data types.

We will have an additional lesson that focuses on processing text data. What follows are some common techniques we can use to apply rules to help bring some consistency to handling both numeric and categorical attributes.

**Cleaning the Missing**

Many of the techniques to 'normalize' the data will fail if the transformation is done on a missing value. Missing values can truly be absent (e.g. the dreaded double comma in csv files) or marked with a special character like None, NAN, NaN, nan,null, NULL, void, 'n/a', or the empty string (i.e ''). Pandas, NumPy, and Sklearn all provide ways to help with cleaning and normalizing data.

#**A titanic example**

![](https://drive.google.com/uc?export=view&id=1T62pGhC6VkO8Ya1jJe0hvZUvooEOjtDL)

The Titanic sank on April 15th, 1912 after hitting an iceberg. It had roughly 2208 passengers and crew aboard (the exact number seems to be [unknown](http://www.icyousee.org/titanic.html).) A few good [references](https://www.historyonthenet.com/the-titanic) for some [details](https://titanicfacts.net/titanic-passengers/) show the discrepancies in the exact numbers.

The titanic dataset provides a good opportunity to work on a classic dataset that is in need of some cleaning and normalization. This lesson includes
one of the more complete datasets. There are many available.

We can load up the dataset and print out the first row so you can get a feel for the data. You can [read](http://campus.lakeforest.edu/frank/FILES/MLFfiles/Bio150/Titanic/TitanicMETA.pdf) about the meaning of each data field as well.

In [1]:
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', None)
pd.set_option('display.width', 200)

def build_titanic():
  df = pd.read_csv('titanic.csv')
  print('total rows', len(df))

  # add an extra passenger
  extra = {'name': 'Jack Dawson', 'age': 28, 'id': len(df)+1, 'gender': 'male'}
  df = df.append(extra, ignore_index=True)

  # add an extra field for using a custom transformer
  df['sid'] = df['age'].apply(lambda x: 'NA' if np.isnan(x) else "{:.0f}".format(1912-x)).astype('string')
  df['sid'].replace('NA', np.nan, inplace=True)
  
  return df.copy()

df = build_titanic()
print(df.head(1))

total rows 2207
   id                 name gender   age class embarked        country  ticketno  fare  sibsp  parch survived   sid
0   1  Abbing, Mr. Anthony   male  42.0   3rd        S  United States    5547.0  7.11    0.0    0.0       no  1870

**Getting the missing counts**

One of the first things you should do is get a count of which attributes have missing values. You can easily do this with pandas. In the example below, we ask for all null (NaN) values and then sum them up. When you look at the result, any column with a non-zero value has missing data.

In [2]:
def show_missing(df):
  print(df.isna().sum())
  
show_missing(df)

id            0
name          0
gender        0
age           2
class         1
embarked      1
country      82
ticketno    892
fare        917
sibsp       901
parch       901
survived      1
sid           2
dtype: int64

You can see that 'age' has only 2 missing values. That is, 2 rows/instances don't have a value for the 'age' column. If a majority of your rows have missing values for a certain attribute, the best strategy is to simply not use that attribute in any of the analysis (e.g. country, ticketno, fare, sibsp, parch).

### **Imputing the missing**

One of the most common ways to deal with missing values is to interpolate (e.g. estimate or impute) the value from the values that are present.

**Pandas**

In the example below, we fill empty/missing values for the 'age' attribute with the mean for that column. You can also use the calculated median, mode or a constant as well.

In [3]:
def process_missing_age(df, debug=True):

  # mask to select the rows where age is empty
  mask = df.age.isna()

  # calculate the mean (the replacement value)
  replace_value = df.age.mean()
  
  # fill those values with the value calculated
  df['age_clean']= df[mask].age.fillna(replace_value)
  if debug:
    # print out the updates
    cols = ['id', 'name', 'age', 'age_clean']
    print(df[mask][cols].head())
    
# pass in a copy, so we keep the original
process_missing_age(df.copy())

      id                    name  age  age_clean
439  440  Gheorgheff, Mr. Stanio  NaN   30.43563
677  678     Kraeff, Mr. Theodor  NaN   30.43563

**Sklearn**

Another way to impute the missing is to use sklearn. The same 'age' column is updated to the mean for any missing value. Note how we create a new attribute to hold the 'age' column that is free of any missing values. 

Also, read the [documentation](https://scikit-learn.org/stable/modules/generated/sklearn.impute.SimpleImputer.html) for different strategies you can use. Note sklearn's repeated fit and transform process is applied here (even though there is no training and fitting of models).

In [4]:
np.array([1, 2, 3]).reshape(-1, 1)

array([[1],
       [2],
       [3]])

In [5]:
def process_missing_age_skl(df, debug=True):
  from sklearn.impute import SimpleImputer
  import numpy as np

  # np.nan is the how pandas marks missing values
  # replace with the mean
  imr = SimpleImputer(strategy="mean", missing_values=np.nan)

  # Impute values
  values = df.age.values.reshape(-1,1)
  print(df.age.values)
  out = imr.fit_transform(values)

  # now we assign those values to a new column
  df['im_age'] = out

  if debug:
    cols = ['id', 'name', 'age', 'im_age']
    mask = df.age.isna()
    print(df[mask][cols].head())
    print('Missing')
    print(df.isna()[cols].sum())
    
process_missing_age_skl(df.copy())

[42. 13. 16. ... 20. 26. 28.]
      id                    name  age    im_age
439  440  Gheorgheff, Mr. Stanio  NaN  30.43563
677  678     Kraeff, Mr. Theodor  NaN  30.43563
Missing
id        0
name      0
age       2
im_age    0
dtype: int64

In [6]:
df.age.values.reshape(-1, 1)

array([[42.],
       [13.],
       [16.],
       ...,
       [20.],
       [26.],
       [28.]])

A few lines of code to note. See if you understand the following from the above code block:



```
# Impute values
values = df.age.values.reshape(-1,1)
out = imr.fit_transform(values)
```

* sklearn needs its data in numpy/array form
* .values is the underlying numpy array
* .reshape(-1,1) reshapes the data to a single feature/column
* -1,1 means all rows, 1 column

It's also possible to use a more 'user-friendly' version as well:

```
# Impute values
features = ['age']
values = df[features]
out = imr.fit_transform(values)
```

In this case, we can actually fit and transform multiple columns. If you do that it's important to take caution on how you assign the result back to the pandas dataframe.

**Deleting the missing instances (rows)**

Another, perhaps drastic, technique is to simply remove any row that has a missing value for any of the attributes you need. This strategy is fine if you have plenty of data. You can also decide to delete only if an instance has multiple missing attributes.

**Predicting the missing;**

Another viable option is to use a machine learning algorithm to figure out which value should be used to replace the missing. Although we haven't discussed the K-Nearest Neighbors (KNN) algorithm (a supervised ML algorithm for both classification and regression), it's a viable solution if you want a more robust strategy than simple statistical (e.g. mean, median, mode) replacement. If there's enough time, we will have a lesson on KNN.

#**Categorical Data**

![](https://drive.google.com/uc?export=view&id=1_8d2JROR2Oa4_XMi2UIQEkdqi4YhQJnV)

For handling categorical data or data whose attribute values are labels/text, the main focus is being consistent for handling the different categories. The goal is to map each label/category to a unique number.

Many of the same rules apply for text cleaning; however, if the label is coming from a computer, process, sensor, or standardized input, much of the cleaning is already done for you. That is, you don't have to worry about different labels having the same semantic meaning. For example, if your categories are coming from a web form, you would have to deal with misspellings, etc.

###**Mapping labels to numbers**

All machine learning algorithms need a numeric representation of any text value. If you have categorical attributes whose values are strings, you will need to map these values to a number.

**Nominal Attributes**
For simple categorical data where there is no ranking order of the values, we can simply map the labels to numbers. In Pandas, it's very straight forward. You can use the .astype("category").cat.codes on any categorical data type:

```
df['g_code'] = df['gender'].astype("category").cat.codes
```
Because the process is so straight forward, we can create a utility function to help us map any column:

In [7]:
def category_to_number(df, col_name, new_name, debug=True):

  # map the categories to unique integers (starting at 0)
  df[new_name] = df[col_name].astype("category").cat.codes

  if debug:
    values = df[col_name].unique()
    print('{:d} unique values for {:s}:'.format(len(values), col_name), values)
    # show how many rows are in each group
    print(df.groupby([col_name]).count()[new_name].reset_index())
    print(df.groupby([col_name]).count()[new_name].sum())
  
  return df

# map gender to a 0/1 code
cols = ['gender', 'g_code']
df2 = category_to_number(df.copy(), *cols)  # putting * to good use
print(df2[cols][0:10]) # first 10 rows

2 unique values for gender: ['male' 'female']
   gender  g_code
0  female     489
1    male    1719
2208
   gender  g_code
0    male       1
1    male       1
2    male       1
3  female       0
4  female       0
5    male       1
6    male       1
7  female       0
8    male       1
9    male       1

**Handling missing values**

For the 'gender' column, there are no missing values. However if there are any missing values, those values get marked with a -1 by default. If you want to keep the np.nan values for missing you can simply do a replace:

```
df2['g_code'] = df2['g_code'].replace(-1, np.nan)
```

**port of embarkation**
We can use the same function to map port of embarkation, which does have some missing values. Let's take a look at how pandas handles those missing values. Be sure to understand how pandas treats the missing values

In [8]:
# map port of embarkation (C, Q, S)
# C = Cherbourg, Q = Queenstown, S = Southampton,  B = ??
cols = ['embarked', 'e_code']
df = category_to_number(df.copy(), *cols)
print(df[cols][0:10]) # first 10 rows
mask = df.embarked.isna()
print(df[mask])

5 unique values for embarked: ['S' 'C' 'B' 'Q' nan]
  embarked  e_code
0        B     197
1        C     271
2        Q     123
3        S    1616
2207
  embarked  e_code
0        S       3
1        S       3
2        S       3
3        S       3
4        S       3
5        S       3
6        C       1
7        C       1
8        C       1
9        S       3
        id         name gender   age class embarked country  ticketno  fare  sibsp  parch survived   sid  e_code
2207  2208  Jack Dawson   male  28.0   NaN      NaN     NaN       NaN   NaN    NaN    NaN      NaN  1884      -1

**Codebook WARNING**

As you may have noticed, there's not much control over which numbers will be assigned to which categories. If you needed 'Cherbourg' to be a specific numeric value (because of an outside requirement or codebook -- a document that specifies how the mappings are done), you would have to adjust the algorithm. The next section discusses, one possible solution.

**Ordinal Mapping**
When your categorical attributes have an inherent ranking (e.g. review of stars, likert scales, etc), you can define your own value map that maintains the order as well.

**“ Likert's Log**: As a word of caution, just because there's an order of 'rank' to your values, these values are still not 'numeric'.

For example, if you had a survey that ranked items using a [Strongly Agree, Agree, Neither, Disagree, Strongly Disagree] scale or you asked someone to rank an issue from 1 to 5, don't assume you can work with averages. Also, the interval between different values isn't mathematically stable. For example, the difference between 'Strongly Agree' and 'Agree' cannot be assumed to be the same as the difference between 'Disagree' and 'Strongly Disagree'. Using counts, medians, and modes is usually the best you can do.

With Pandas, you can use the map function to create custom rank values:

```
df[new_name] = df[column_name].map(kv_map)
```

Let's use that pattern to map the class attribute that categorizes both the passengers and crew. Note that all the crew gets the value 4.

In [9]:
def map_class_attribute(df, debug=True):

  # map 1st/2nd/3rd class as ordinal 1st < 2nd < 3rd + missing
  # replace nan with the value 'unknown'
  df['class'].fillna('unknown', inplace=True)
  # assign the labels values
  ord_map = {'3rd':3, '2nd':2, '1st':1,
             'engineering crew':4,
             'victualling crew':4,
             'restaurant staff':4,
             'deck crew':4, 'unknown':0}

  # apply the map to the 'class' attribute
  df['o_class'] = df['class'].map(ord_map)

  if debug:
    print(df['class'].unique().tolist())
    # show how many rows are in each group
    print(df.groupby(['class']).count()['o_class'].reset_index())

  return df
  
df_class = map_class_attribute(df.copy())
print(df_class.head())

['3rd', '2nd', '1st', 'engineering crew', 'victualling crew', 'restaurant staff', 'deck crew', 'unknown']
              class  o_class
0               1st      324
1               2nd      284
2               3rd      709
3         deck crew       66
4  engineering crew      324
5  restaurant staff       69
6           unknown        1
7  victualling crew      431
   id                            name  gender   age class embarked        country  ticketno   fare  sibsp  parch survived   sid  e_code  o_class
0   1             Abbing, Mr. Anthony    male  42.0   3rd        S  United States    5547.0   7.11    0.0    0.0       no  1870       3        3
1   2       Abbott, Mr. Eugene Joseph    male  13.0   3rd        S  United States    2673.0  20.05    0.0    2.0       no  1899       3        3
2   3     Abbott, Mr. Rossmore Edward    male  16.0   3rd        S  United States    2673.0  20.05    1.0    1.0       no  1896       3        3
3   4  Abbott, Mrs. Rhoda Mary 'Rosa'  female  39.0   3rd        S        England    2673.0  20.05    1.0    1.0      yes  1873       3        3
4   5     Abelseth, Miss. Karen Marie  female  16.0   3rd        S         Norway  348125.0   7.13    0.0    0.0      yes  1896       3        3

Once we have those numeric values, it's pretty easy to separate everyone into crew and passengers:

In [10]:
def print_passenger_class_stats(df):
  is_crew = df['o_class'].isin([4])

  # any of these will work
  is_pass = df['o_class'].isin([1,2,3])
  is_pass = (df['o_class'] < 4 ) & (df['o_class'] > 0)
  is_pass = ~is_crew  # will include the unknowns

  print('crew', len(df[is_crew]))
  print('pass', len(df[is_pass]))
  
# this assumes map_class_attribute is done
print_passenger_class_stats(df_class.copy())

crew 890
pass 1318

**Binary Fields**

Sometimes you may want an attribute to simply indicate a simple Yes/No, On/Off, Have/not- Have value.

For example, we can add a is_passenger attribute to the data. This field will either be 0 (False) or 1 (True) indicating if the person was a passenger on the ship (as opposed to being part of the crew.)

In [11]:
def create_binary_field(df, debug=True):
  # Binary Fields
  from sklearn.preprocessing import Binarizer
  binarizer = Binarizer(threshold=3, copy=True)  # <= 3 asssing
  column_values = binarizer.fit_transform(df.o_class.values.reshape(-1, 1))
  
  # flip the values (1 -> 0; 0 -> 1)
  df['is_passenger'] = 1 - column_values
  if debug:
    print(column_values)
    print(df.head(5))

print(create_binary_field(df_class.copy()))

[[0]
 [0]
 [0]
 ...
 [1]
 [1]
 [0]]
   id                            name  gender   age class embarked        country  ticketno   fare  sibsp  parch survived   sid  e_code  o_class  is_passenger
0   1             Abbing, Mr. Anthony    male  42.0   3rd        S  United States    5547.0   7.11    0.0    0.0       no  1870       3        3             1
1   2       Abbott, Mr. Eugene Joseph    male  13.0   3rd        S  United States    2673.0  20.05    0.0    2.0       no  1899       3        3             1
2   3     Abbott, Mr. Rossmore Edward    male  16.0   3rd        S  United States    2673.0  20.05    1.0    1.0       no  1896       3        3             1
3   4  Abbott, Mrs. Rhoda Mary 'Rosa'  female  39.0   3rd        S        England    2673.0  20.05    1.0    1.0      yes  1873       3        3             1
4   5     Abelseth, Miss. Karen Marie  female  16.0   3rd        S         Norway  348125.0   7.13    0.0    0.0      yes  1896       3        3             1
None

**One Hot Encoding**

As mentioned in a previous lesson, one hot encoding simply assigns either a 1 or a 0 to an attribute if that attribute is present or not. It's an extension of using the Binarizer. The issue is that for categorical (nominal or ordinal), it's not accurate that some values will be 'higher' than other only because their mapping value was larger. As we just saw, if you map category labels, for example, to the numbers 0 through 100 (or 0.0 to 1.0), the ML algorithm may think the higher values contributes more to some correlation or calculation than the lower values. It's also useful just to mark some attributes as being present or not. This is where one hot encoding becomes useful.
<br>
<br>

In the previous section we built a simple one-hot attribute (is_passenger), this example takes an entire column of categorical values and builds separate one-hot columns for each unique value. It's simply a convenient way to create one-hot attributes. The image below shows an example of the result of one hot encoding of the embankment attribute:


![](https://drive.google.com/uc?export=view&id=1tBf_U9C70qAmBFZgcqPltDDbv5ueC1DZ)

In [12]:
def one_hot_encoding(df):
  import numpy as np
  from sklearn.preprocessing import OneHotEncoder

  onehot = OneHotEncoder(dtype=np.int, sparse=True)
  
  # fill in any missing values with 'UNK'
  df['embarked'].fillna('UKN', inplace=True)
  values = df['embarked'].values.reshape(-1, 1)
  values = onehot.fit_transform(values).toarray() # it is sparse
  labels = onehot.categories_
  
  return pd.DataFrame(values, columns=labels)

df_hot = one_hot_encoding(df.copy())
print(df_hot.tail(20))

      B  C  Q  S UKN
2188  0  0  0  1   0
2189  0  0  0  1   0
2190  0  0  0  1   0
2191  0  0  0  1   0
2192  0  0  0  1   0
2193  0  0  0  1   0
2194  0  0  0  1   0
2195  0  0  0  1   0
2196  0  0  0  1   0
2197  0  0  0  1   0
2198  1  0  0  0   0
2199  0  0  0  1   0
2200  0  0  0  1   0
2201  0  0  0  1   0
2202  1  0  0  0   0
2203  0  0  0  1   0
2204  0  0  0  1   0
2205  0  0  0  1   0
2206  0  0  0  1   0
2207  0  0  0  0   1

/var/folders/zq/gn09x0d53r74hd7z0lp249cr0000gp/T/ipykernel_33131/1856968406.py:5: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  onehot = OneHotEncoder(dtype=np.int, sparse=True)

The panda's get_dummies method provides another way to do one-hot encoding:

```
print(pd.get_dummies(df['embarked'], dummy_na=True))
```

#**Binning/Discretizating Features**
Although not strictly for categorical data, another option is to put data into bins. Pandas provides the cut method to create custom bins:

In [13]:
# binning data
def bin_demo1(df):
# set up custom bins
  bins = [0, 3, 8, 16, 21, 35, 55, 200] 
  labels = ['infant','child','youth','young adult','adult','middle','senior'] 
  age_bins = pd.cut(df['age'], bins=bins, labels=labels, right=False) 
  df['age_cat'] = age_bins
  print(df['id age age_cat'.split()].head(10))
  return df
  
df_bin = bin_demo1(df.copy())

   id   age      age_cat
0   1  42.0       middle
1   2  13.0        youth
2   3  16.0  young adult
3   4  39.0       middle
4   5  16.0  young adult
5   6  25.0        adult
6   7  30.0        adult
7   8  28.0        adult
8   9  27.0        adult
9  10  20.0  young adult

Sklearn provides a similar preprocessing utility class for binning, named KBinsDiscretizer. It has the familiar fit and transform API. It also requires that the attribute has no missing values.

In [14]:
def bin_demo2(df):
  # uniform bins
  from sklearn.preprocessing import KBinsDiscretizer

  # this must be done first
  df['age'].fillna(df['age'].mean(), inplace=True)
  
  binner = KBinsDiscretizer(n_bins=8, encode='ordinal', strategy='uniform')
  values = binner.fit_transform(df['age'].values.reshape(-1, 1))
  df['age_cat2'] = values
  print(df['id age age_cat age_cat2'.split()].head(10))

bin_demo2(df_bin.copy())

   id   age      age_cat  age_cat2
0   1  42.0       middle       4.0
1   2  13.0        youth       1.0
2   3  16.0  young adult       1.0
3   4  39.0       middle       4.0
4   5  16.0  young adult       1.0
5   6  25.0        adult       2.0
6   7  30.0        adult       3.0
7   8  28.0        adult       3.0
8   9  27.0        adult       2.0
9  10  20.0  young adult       2.0

We can even use the same class to create one-hot encoded bins. By changing it's strategy. Be sure to [read](https://scikit-learn.org/stable/modules/generated/sklearn.impute.SimpleImputer.html) its documentation.

In [15]:
def bin_demo3(df):
  # one hot binning
  from sklearn.preprocessing import KBinsDiscretizer

  bin_count = 4
  df['age'].fillna(df['age'].mean(), inplace=True)
  binner = KBinsDiscretizer(n_bins=bin_count, encode='onehot-dense', strategy='uniform')
  values = binner.fit_transform(df['age'].values.reshape(-1, 1))
  labels = ['bin {:d}'.format(i) for i in range(1, bin_count+1)]
  
  df2 = pd.DataFrame(values, columns=labels)
  df2['age'] = df['age']
  print(df2.head(10))

bin_demo3(df.copy())

   bin 1  bin 2  bin 3  bin 4   age
0    0.0    0.0    1.0    0.0  42.0
1    1.0    0.0    0.0    0.0  13.0
2    1.0    0.0    0.0    0.0  16.0
3    0.0    0.0    1.0    0.0  39.0
4    1.0    0.0    0.0    0.0  16.0
5    0.0    1.0    0.0    0.0  25.0
6    0.0    1.0    0.0    0.0  30.0
7    0.0    1.0    0.0    0.0  28.0
8    0.0    1.0    0.0    0.0  27.0
9    0.0    1.0    0.0    0.0  20.0

#**Numeric Data**

The goal for normalizing numeric data is essentially same: you want your values to accurately represent the underlying measurement. However, there's an additional consideration called scaling (or feature scaling). The idea is that you don't want the units of one feature (i.e. column/attribute) to overshadow the units of another.

![](https://drive.google.com/uc?export=view&id=1eFOO24Rb9gU98yH43smcy3WxxOvd41Oi)

#**Feature Scaling Data**
One of the most important transformation to make is to ensure each of your numeric attributes are scaled so that one attribute's units are in the same 'scale' as others. Feature scaling standardizes the value range of features of the data.

Let's go over some vocabulary relevant for feature 'scaling':
* **Rescaling** a feature vector (think columns of data) means to add or subtract a constant and then multiply or divide by a constant, as you would do to change the units of measurement of the data, for example, to convert a temperature from Celsius to Fahrenheit.

* **Normalizing** a feature vector usually means dividing each element by the norm (L1 or L2) of the vector (||x||). However, for this lesson it will refer to a type of rescaling.

* **Standardizing** a vector means subtracting a measure of location (mean or median) and dividing by a measure of scale (e.g. standard deviation).

**Min-Max Scaling**

**(a.k.a Min-Max Normalization)**

In min-max scaling, you transform the data such that the features are within a specific range usually [0, 1].

Scaling is important for algorithms where distance between data points is important. You want to avoid attributes working together but are on different scales. For example, having one attribute measured in feet while the other is in pounds while another is in miles, will wreak havoc on the ML algorithm's calculations.

![](https://drive.google.com/uc?export=view&id=1yjhjzsYIzUuQiL_5tI3g1Rv4E8NUIkzX)


You can see how the min-max formula scales by the data range (also called peak-to-peak). Run the code below to view some of the values that are used to scale each data item:

In [16]:
import numpy as np
def fare_stats(df):
  df['fare'].fillna(df['fare'].mean(), inplace=True)

  print(df['fare'].min())
  min_fair = np.min(df['fare'])
  max_fair = np.max(df['fare'])
  print(min_fair, max_fair)
  print(np.ptp(df['fare']))
  
df = build_titanic()
fare_stats(df.copy())

total rows 2207
3.0305
3.0305 512.0607
509.0302

**Exercise**

Create a function named fare_min_max_scaled_np that uses NumPy to scale the attributes using the min-max formula given above.

* You can only use NumPy to do the calculations.
* Add the new values to an attribute named fare_mms 
* You must return the dataframe

In [17]:
def fare_min_max_scaled_np(df):
  min_fair = np.min(df['fare'])
  max_fair = np.max(df['fare'])
  df['fare_mms'] = df.fare.apply(lambda f: (f - min_fair) / (max_fair - min_fair))
  return df

df = build_titanic()
fare_min_max_scaled_np(df)

total rows 2207

        id                            name  gender   age             class embarked        country  ticketno   fare  sibsp  parch survived   sid  fare_mms
0        1             Abbing, Mr. Anthony    male  42.0               3rd        S  United States    5547.0   7.11    0.0    0.0       no  1870  0.008014
1        2       Abbott, Mr. Eugene Joseph    male  13.0               3rd        S  United States    2673.0  20.05    0.0    2.0       no  1899  0.033435
2        3     Abbott, Mr. Rossmore Edward    male  16.0               3rd        S  United States    2673.0  20.05    1.0    1.0       no  1896  0.033435
3        4  Abbott, Mrs. Rhoda Mary 'Rosa'  female  39.0               3rd        S        England    2673.0  20.05    1.0    1.0      yes  1873  0.033435
4        5     Abelseth, Miss. Karen Marie  female  16.0               3rd        S         Norway  348125.0   7.13    0.0    0.0      yes  1896  0.008054
...    ...                             ...     ...   ...               ...      ...            ...       ...    ...    ...    ...      ...   ...       ...
2203  2204             Yearsley, Mr. Harry    male  40.0  victualling crew        S        England       NaN    NaN    NaN    NaN      yes  1872       NaN
2204  2205        Young, Mr. Francis James    male  32.0  engineering crew        S        England       NaN    NaN    NaN    NaN       no  1880       NaN
2205  2206             Zanetti, Sig. Minio    male  20.0  restaurant staff        S        England       NaN    NaN    NaN    NaN       no  1892       NaN
2206  2207              Zarracchi, Sig. L.    male  26.0  restaurant staff        S        England       NaN    NaN    NaN    NaN       no  1886       NaN
2207  2208                     Jack Dawson    male  28.0               NaN      NaN            NaN       NaN    NaN    NaN    NaN      NaN  1884       NaN

[2208 rows x 14 columns]


Be sure to write your own test for fare_min_max_scaled_np function. How will you confirm that the operation succeeded?

```
def test_fare_mms(df):
  pass

test_fare_mms(df.copy())
```

In [18]:
def test_mms(df):  
	min_fair = np.min(df['fare'])
	max_fair = np.max(df['fare'])
	fare = df.fare_mms.dropna().apply(lambda mms: mms * (max_fair - min_fair) + min_fair)
	df['recalculated_fare'] = fare
	return df.dropna()[~(df['recalculated_fare'].dropna() == df['fare'].dropna())]
	return (fare == df['fare'].dropna()).all()

result = test_mms(df.copy())
result

/var/folders/zq/gn09x0d53r74hd7z0lp249cr0000gp/T/ipykernel_33131/4008974831.py:6: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  return df.dropna()[~(df['recalculated_fare'].dropna() == df['fare'].dropna())]

        id                                          name  gender   age class embarked        country  ticketno     fare  sibsp  parch survived   sid  fare_mms  recalculated_fare
126    127                  Blackwell, Mr. Stephen Weart    male  45.0   1st        S  United States  113784.0  35.1000    0.0    0.0       no  1867  0.063001            35.1000
149    150                     Brewe, Dr. Arthur Jackson    male  46.0   1st        C  United States  112379.0  39.1200    0.0    0.0       no  1866  0.070899            39.1200
202    203                Carraú-Esteves, Mr. José Pedro    male  17.0   1st        S        Uruguay  113059.0  47.0200    0.0    0.0       no  1895  0.086418            47.0200
203    204         Carrau, Mr. Francisco Mauro Severiano    male  27.0   1st        S        Uruguay  113059.0  47.0200    0.0    0.0       no  1885  0.086418            47.0200
217    218                   Chaffee, Mr. Herbert Fuller    male  46.0   1st        S  United States    5734.0  61.0306    1.0    0.0       no  1866  0.113942            61.0306
218    219                Chaffee, Mrs. Carrie Constance  female  47.0   1st        S  United States    5734.0  61.0306    1.0    0.0      yes  1865  0.113942            61.0306
219    220                 Chambers, Mr. Norman Campbell    male  27.0   1st        S  United States  113806.0  53.0200    1.0    0.0      yes  1885  0.098205            53.0200
220    221                         Chambers, Mrs. Bertha  female  32.0   1st        S  United States  113806.0  53.0200    1.0    0.0      yes  1880  0.098205            53.0200
304    305                Davies, Master. John Morgan jr    male   8.0   2nd        S        England   33112.0  36.1500    1.0    1.0      yes  1904  0.065064            36.1500
310    311                            Davies, Mrs. Agnes  female  48.0   2nd        S        England   33112.0  36.1500    0.0    2.0      yes  1864  0.065064            36.1500
359    360                Duff Gordon, Sir. Cosmo Edmund    male  49.0   1st        C        England   11755.0  39.1200    1.0    0.0      yes  1863  0.070899            39.1200
420    421            Frölicher, Miss. Hedwig Margaritha  female  22.0   1st        C    Switzerland   13568.0  49.1000    0.0    2.0      yes  1890  0.090504            49.1000
426    427                   Futrelle, Mr. Jacques Heath    male  37.0   1st        S        England  113803.0  53.0200    1.0    0.0       no  1875  0.098205            53.0200
427    428                       Futrelle, Mrs. Lily May  female  35.0   1st        S        England  113803.0  53.0200    1.0    0.0      yes  1877  0.098205            53.0200
436    437                            Gee, Mr. Arthur H.    male  47.0   1st        S        England  111320.0  38.1000    0.0    0.0       no  1865  0.068895            38.1000
461    462                Goodwin, Master. Harold Victor    male   9.0   3rd        S        England    2144.0  46.1800    5.0    2.0       no  1903  0.084768            46.1800
462    463                Goodwin, Master. Sidney Leslie    male   1.0   3rd        S        England    2144.0  46.1800    5.0    2.0       no  1911  0.084768            46.1800
463    464            Goodwin, Master. William Frederick    male  11.0   3rd        S        England    2144.0  46.1800    5.0    2.0       no  1901  0.084768            46.1800
464    465                   Goodwin, Miss. Jessie Allis  female  10.0   3rd        S        England    2144.0  46.1800    5.0    2.0       no  1902  0.084768            46.1800
465    466                    Goodwin, Miss. Lillian Amy  female  16.0   3rd        S        England    2144.0  46.1800    5.0    2.0       no  1896  0.084768            46.1800
466    467                   Goodwin, Mr. Charles Edward    male  14.0   3rd        S        England    2144.0  46.1800    5.0    2.0       no  1898  0.084768            46.1800
467    468                 Goodwin, Mr. Frederick Joseph    male  42.0   3rd        S        England    2144.0  46.1800    1.0    6.0       no  1870  0.084768            46.1800
468    469                         Goodwin, Mrs. Augusta  female  43.0   3rd        S        England    2144.0  46.1800    1.0    6.0       no  1869  0.084768            46.1800
526    527                         Head, Mr. Christopher    male  42.0   1st        S        England  113038.0  42.1000    0.0    0.0       no  1870  0.076753            42.1000
548    549                  Hippach, Miss. Jean Gertrude  female  17.0   1st        C  United States  111361.0  57.1907    0.0    1.0      yes  1895  0.106399            57.1907
549    550                      Hippach, Mrs. Ida Sophia  female  44.0   1st        C  United States  111361.0  57.1907    0.0    1.0      yes  1868  0.106399            57.1907
602    603                      Jensen, Mr. Niels Rasmus    male  48.0   3rd        S        Denmark  350048.0   7.0101    0.0    0.0       no  1864  0.007818             7.0101
693    694                         Laroche, Miss. Louise  female   1.0   2nd        C         France    2123.0  41.1107    1.0    2.0      yes  1911  0.074809            41.1107
694    695      Laroche, Miss. Simonne Marie Anne Andrée  female   3.0   2nd        C         France    2123.0  41.1107    1.0    2.0      yes  1909  0.074809            41.1107
695    696        Laroche, Mr. Joseph Philippe Lemercier    male  25.0   2nd        C         France    2123.0  41.1107    1.0    2.0       no  1887  0.074809            41.1107
696    697           Laroche, Mrs. Juliette Marie Louise  female  22.0   2nd        C         France    2123.0  41.1107    1.0    2.0      yes  1890  0.074809            41.1107
738    739                    Loring, Mr. Joseph Holland    male  30.0   1st        S  United States  113801.0  45.1000    0.0    0.0       no  1882  0.082646            45.1000
743    744                   Lundahl, Mr. Johan Svensson    male  50.0   3rd        S         Sweden  347743.0   7.0101    0.0    0.0       no  1862  0.007818             7.0101
773    774                     Marvin, Mr. Daniel Warner    male  18.0   1st        S  United States  113773.0  53.0200    1.0    0.0       no  1894  0.098205            53.0200
774    775           Marvin, Mrs. Mary Graham Carmichael  female  18.0   1st        S       Scotland  113773.0  53.0200    1.0    0.0      yes  1894  0.098205            53.0200
823    824                      Mock, Mr. Philipp Edmund    male  30.0   1st        C  United States   13236.0  57.1500    1.0    0.0      yes  1882  0.106319            57.1500
876    877                  Nicholls, Mr. Joseph Charles    male  19.0   2nd        S        England   33112.0  36.1500    1.0    1.0       no  1893  0.065064            36.1500
919    920                   Østby, Miss. Helen Ragnhild  female  22.0   1st        S  United States  113509.0  61.1907    0.0    1.0      yes  1890  0.114257            61.1907
920    921                Ostby, Mr. Engelhart Cornelius    male  64.0   1st        S  United States  113509.0  61.1907    0.0    1.0       no  1848  0.114257            61.1907
1005  1006           Rheims, Mr. George Alexander Lucien    male  33.0   1st        C  United States   17607.0  39.1200    0.0    0.0      yes  1879  0.070899            39.1200
1086  1087                           Schabert, Mrs. Emma  female  35.0   1st        C        Germany   13236.0  57.1500    1.0    0.0      yes  1877  0.106319            57.1500
1106  1107                       Silvey, Mrs. Alice Gray  female  39.0   1st        C  United States   13507.0  55.1800    1.0    0.0      yes  1873  0.102449            55.1800
1107  1108                     Silvey, Mr. William Baird    male  51.0   1st        C  United States   13507.0  55.1800    1.0    0.0       no  1861  0.102449            55.1800
1109  1110  Simonius-Blumer, Mr. Colonel (Oberst) Alfons    male  56.0   1st        S    Switzerland   13213.0  35.1000    0.0    0.0      yes  1856  0.063001            35.1000
1110  1111                          Sincock, Miss. Maude  female  20.0   2nd        S        England   33112.0  36.1500    0.0    0.0      yes  1892  0.065064            36.1500
1128  1129                  Sloper, Mr. William Thompson    male  28.0   1st        S  United States  113788.0  35.1000    0.0    0.0      yes  1884  0.063001            35.1000
1305  1306                             Woolner, Mr. Hugh    male  46.0   1st        S        England   19947.0  35.1000    0.0    0.0      yes  1866  0.063001            35.1000

**Sklearn's Min-Max Scalar**

Sklearn also provides a simple minmax_scale function. We can use it to confirm our results as well. Below also shows how sklearn uses the fit & transform methods on its MinMaxScaler. In this case, fit would calculate the min and max first; transform then applies the formula to all the data.

In [19]:
from sklearn.preprocessing import minmax_scale
from sklearn.preprocessing import MinMaxScaler

def fare_min_max_scaled(df):
  df['fare_scaled'] = minmax_scale(df['fare'])

  # fit & transform way
  scaler = MinMaxScaler()
  s_values = scaler.fit_transform(df['fare'].values.reshape(-1,1))
  df['fare_scaled2'] = s_values
  print(df['fare fare_scaled fare_scaled2'.split()].head(10))

fare_min_max_scaled(df.copy())

      fare  fare_scaled  fare_scaled2
0   7.1100     0.008014      0.008014
1  20.0500     0.033435      0.033435
2  20.0500     0.033435      0.033435
3  20.0500     0.033435      0.033435
4   7.1300     0.008054      0.008054
5   7.1300     0.008054      0.008054
6  24.0000     0.041195      0.041195
7  24.0000     0.041195      0.041195
8  18.1509     0.029704      0.029704
9   7.1806     0.008153      0.008153

**Mean Normalization Mean Centering**

Another version of Min-Max Scaling is named mean normalization. In this case, the mean is subtracted from each value (rather than the minimum value).

Note that Mean centering is the subtraction part -- and it can be done without any further scaling. The dividing by the data range provides the scaling part.

**Z-Score Scaling; Standardization**

Sometimes it's important that an attribute has certain statistical requirements. We can 'normalize' (here normalize is used in the statistical sense) the values such that the data is centered at 0 with a standard deviation of 1. This technique is called z-score scaling or just standardization or z-score normalization.

Z-score scaling is done using the following formula:

![](https://drive.google.com/uc?export=view&id=1p2OVmwJvXRr-YTkxiOEtmDu3rHLRTngr)

Here is the original feature vector, is the mean of that feature vector, and σ is its standard deviation. By subtracting the mean from the distribution, you are essentially shifting it towards left or right by amount equal to mean. By dividing by the standard deviation σ, you are changing the shape of distribution.

The new standard deviation of this standardized distribution is 1 and μ = 0.
With sklearn, you can do this transformation using the scale function or the StandardScaler class:

In [20]:
from sklearn.preprocessing import scale
from sklearn.preprocessing import StandardScaler

def fare_z_scaled(df):

  # simple way
  df['fare_z'] = scale(df['fare'])

  # fit & transform way
  scaler = StandardScaler()
  s_values = scaler.fit_transform(df['fare'].values.reshape(-1,1))
  df['fare_z2'] = s_values
  print(df['fare fare_z fare_z2'.split()].head(10))

fare_z_scaled(df.copy())

      fare    fare_z   fare_z2
0   7.1100 -0.503660 -0.503660
1  20.0500 -0.255802 -0.255802
2  20.0500 -0.255802 -0.255802
3  20.0500 -0.255802 -0.255802
4   7.1300 -0.503277 -0.503277
5   7.1300 -0.503277 -0.503277
6  24.0000 -0.180142 -0.180142
7  24.0000 -0.180142 -0.180142
8  18.1509 -0.292178 -0.292178
9   7.1806 -0.502308 -0.502308

#**Outlier Detection**

Having outliers in the dataset, can affect scaling. Although there are machine learning algorithms to help with outlier detection, there are a couple of simple approaches.
<br><br>

**Removing the outliers**

A very quick way to isolate the outliers is to remove those values that are over 2.5 standard deviations away from the rest of the values.

In [21]:
import numpy as np
def find_fare_outliers(df):
  df['fare'].fillna(df['fare'].mean(), inplace=True)
  data = df['fare'].values.reshape(-1,1)

  m = np.mean(data)
  s = np.std(data)
  
  # identify outliers
  cut_off = s * 3.5 # pick any number of standard deviations (usually >= 2.0)
  lower, upper = m - cut_off, m + cut_off
  # identify outliers
  outliers = [x for x in data if x < lower or x > upper]
  print("{:d} outliers: min {:.2f} max {:.2f}".format(len(outliers), np.min(outliers),
np.max(outliers)))
  
  # remove outliers
  # outliers_removed = [x for x in data if x >= lower and x <= upper]

find_fare_outliers(df.copy())

38 outliers: min 211.06 max 512.06

You can actually remove the outliers by uncommenting the last line.

**Robust Scaling**

The mean is highly sensitive to outliers. Sklearn's RobustScaler using IQR (interquartile range) to keep all values between the 25th and 75 quartile. It subtracts the column's median and divides by the interquartile range.

This scales the data using


![](https://drive.google.com/uc?export=view&id=1U06oPdGbrrt9QVjmX27vdNLaa6GNtO6c)

RobustScaler can be used when you want to reduce the effects of having many outliers. However, removing unimportant outliers (see above) should also be done.

**Confused ?**

It's not necessarily easy to know which technique to use. The best strategy is to evaluate models with the data prepared using different techniques. Sometimes, it's a combination of a few of the methods.

There are a few guidelines to help make a first approximation:
* if the distribution of the quantity is normal, then it should be standardized,
* if the distribution is not normal, the data should be normalized. This applies if the range of quantity values is large (10s, 100s, etc.) or small (0.01, 0.0001).

**Min-Max Scaler**

* Re-scales to predetermined range [0–1]
* Typical neural network algorithm require data that on a 0-1 scale.
* Doesn’t change distribution’s center (doesn’t correct skewness)
* The distribution of the feature (or any transformations of the feature ) isn’t Gaussian
* Feature falls within a bounded interval (sensitive to outliers)

**Standard Scaler**
* Shifts distribution’s mean to 0 and unit variance
* No predetermined range
* Best to use on data that is approximately normally distributed clustering, PCA (those that rely on using variance)

**Robust Scaler**
* 0 mean and unit variance
* Use of quartile ranges makes this less sensitive to (a few) outliers • No predetermined range

**Custom Cleaning**

Sometimes, it's necessary to provide cleaning beyond what a library has to offer. Sklearn's FunctionTransformer can be used in these situations. For example, the dataset has an 'sid' field which is actually a string representing the birth year of the person on board the Titanic. If you wanted to do 'math' on that field, a FunctionTransformer could be used to convert that string into a number:

The following code (you should implement it) demonstrates how to convert a string field (sid) to an integer. Once that is done, the field can be used like any valid numeric attribute:


> **Coder's Log:** You may see references to integer (int for short) or floating point (float for short). These are different ways to represent numbers. A floating point is a number with a decimal point (e.g 123.45) and an integer has no decimal place (whole numbers). Floating point numbers have more precision.

```
import numpy as np
from sklearn.preprocessing import FunctionTransformer

def string_to_float(v):
  # v is an array of values
  return v.astype(np.float)

def string_to_int(v):
  # v is an array of values
  return v.astype(np.int)

def clean_sid(df):

  # first clean any missing values
  mode = df['sid'].mode()[0]
  df['sid'].fillna(mode, inplace=True)

  # because 'sid' is pandas StringArray, reshape(-1,1) won't work
  # print(type(df['sid'].values))

  # either of these will work
  values = df['sid'].values
  # OR
  # attribute = ['sid']
  # values = df[attribute]
  
  transformer = FunctionTransformer(string_to_int)
  df['sid'] = transformer.fit_transform(values)
  return df
```

The following code cell demonstrates the custom cleaning:

In [22]:

def string_to_float(v):
  # v is an array of values
  return v.astype(np.float)

def clean_sid(df):

  from sklearn.preprocessing import FunctionTransformer

   # need to implement this function
   # using the FunctionTransformer

  mode = df['sid'].mode()[0]
  df['sid'].fillna(mode, inplace=True)

  transformer = FunctionTransformer(string_to_float)
  df['sid'] = transformer.fit_transform(df['sid'].values)

  return df



def demo_custom_cleaning(df):
  try:
    # this will not work
    df['sid'] = df['sid'] - 1912
  except Exception as e:
    print('invalid math')

  # clean it so we can do math on it
  df_c = clean_sid(df)

  df_c['sid'] = 1912 - df_c['sid']
  print(df_c.head())
  
demo_custom_cleaning(df.copy())

invalid math
   id                            name  gender   age class embarked        country  ticketno   fare  sibsp  parch survived   sid  fare_mms
0   1             Abbing, Mr. Anthony    male  42.0   3rd        S  United States    5547.0   7.11    0.0    0.0       no  42.0  0.008014
1   2       Abbott, Mr. Eugene Joseph    male  13.0   3rd        S  United States    2673.0  20.05    0.0    2.0       no  13.0  0.033435
2   3     Abbott, Mr. Rossmore Edward    male  16.0   3rd        S  United States    2673.0  20.05    1.0    1.0       no  16.0  0.033435
3   4  Abbott, Mrs. Rhoda Mary 'Rosa'  female  39.0   3rd        S        England    2673.0  20.05    1.0    1.0      yes  39.0  0.033435
4   5     Abelseth, Miss. Karen Marie  female  16.0   3rd        S         Norway  348125.0   7.13    0.0    0.0      yes  16.0  0.008054

/var/folders/zq/gn09x0d53r74hd7z0lp249cr0000gp/T/ipykernel_33131/1155584546.py:3: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  return v.astype(np.float)

**Pandas Coercion**

Although sklearn's FunctionTransformer is incredibly flexible, for simple type conversion (string-to-int, int-to-string, etc), you can use panda's to_numeric method. If any issues happen in the coercion, np.nan will be used:

```
values = pd.to_numeric(df['xyz_column'], errors='coerce')
```

The to_numeric method will convert values to floats (real numbers). If you want the conversion to be a specific type (like integer) you can either use the downcast [flag](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_numeric.html) or the astype method:

```
values = df['xyz'].astype(int) # if any issues, an exception is thrown
values = df['xyz'].astype(int, errors='ignore') # ignore those exceptions
```

**Date and Time Care**

Handling date and time attributes is a mix of working with text, categorical, and numerical. How you handle the attribute just depends on the level of granularity and its purpose. For example, if you are just marking the month of a purchase, treating dates at the 'month' level as a category is perfectly reasonable. However, if you are working with timestamps of events, then these become numeric fields that you need to work with.

Deciding to scale a date/time field is also application specific. If the year of when a car was manufactured becomes important, than that field can be treated as an integer. Another issue is that more recent years will have a higher weight (the scaled number would be closer to 1) than those that happened early on. This may or may not be what you want.

**What is Regularization -- it sounds like normalization?**

Regularization has to do with preventing overfitting. They are the techniques used to reduce the error by fitting a function appropriately on the given training set and avoid overfitting.

Regularization can be controlled via hyperparameters (those values that are given to configure the algorithm to build a model. Going into the specifics of regularization would be difficult here since it's more appropriate to discuss this when we are trying to avoid over- fitting by adjusting the loss (or objective function). You may hear about L1/L2 regularization which uses the same 'math' as L1, L2 normalization.

As a reminder, Overfitting is when the model doesn't generalize the 'pattern' being learned, but 'memorizes' it instead. Regularization attempts to prevent models from overfitting by using a hyperparameter to affecting the parameters or weights the model is learning.

#**Lesson Assignment**
**Cleaning Cars**

![](https://drive.google.com/uc?export=view&id=1A8hVea1Nx8Ezc4VvFmGx8sMT_xg8ng07)

This lesson will be using a classic dataset on automobiles. The origin of this dataset can be found [here](http://lib.stat.cmu.edu/datasets/).

However, before we can use it for any machine learning algorithms, it needs a lot of cleaning. We will guide you through all the steps that need to be done. Be sure to print out the dataset (df.head()) so you can first familiarize yourself with the data.

For all questions you can solve by using the information in this lesson and (if necessary) the official pandas. (e.g. see [replace](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html)).

**Build the cars**

Create a function named build_cars that does the following:
* loads 'cars.csv' into a pandas dataframe 
* returns the dataframe



```
def build_cars():
   # return the pandas dataframe with cars.csv loaded
   return None
```

In [23]:
import numpy as np
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 200)

def build_cars(*args):
  return pd.read_csv('cars.csv')

df = build_cars()
df

      id   mpg   cylinders  cubicinches   hp  weightlbs   time-to-60    year     brand            notes
0      0   NaN           4          NaN   69       2050            6   1985     Japan.   pulsar (24mpg)
1     32  16.0           6          250  100       3278           18               US.           (1974)
2      1  14.0           8          350  165       4209           12   1972        US.              NaN
3      2  31.9           4           89   71       1925           14   1980    Europe.              NaN
4      3  17.0           8          302  140       3449           11   1971        US.              NaN
..   ...   ...         ...          ...  ...        ...          ...     ...       ...              ...
257  257  17.0           8          305  130       3840           15   1980        US.              NaN
258  258  36.1           4           91   60       1800           16   1979     Japan.              NaN
259  259  22.0           6          232  112       2835           15   1983        US.              NaN
260  260  18.0           6          232  100       3288           16   1972        US.              NaN
261  261  22.0           6          250  105       3353           15   1977        US.              NaN

[262 rows x 10 columns]

**Clean Columns**

Now do the following to the dataframe

* removes the notes and id columns
* remove all spaces from column names
* replaces all empty string values with np.nan
   * see DataFrame.replace method for one possible option
* You can use the df.rename or df.columns.str (which allows you access to all the string methods).

In [24]:
def clean_columns(df):
  df.columns = df.columns.str.strip()
  df.drop(columns=['notes', 'id'], inplace=True)
  df.replace(to_replace='', value=np.nan, inplace=True)

  

  return df

df = clean_columns(build_cars())
df

      mpg  cylinders cubicinches   hp weightlbs  time-to-60    year     brand
0     NaN          4         NaN   69      2050           6   1985     Japan.
1    16.0          6         250  100      3278          18               US.
2    14.0          8         350  165      4209          12   1972        US.
3    31.9          4          89   71      1925          14   1980    Europe.
4    17.0          8         302  140      3449          11   1971        US.
..    ...        ...         ...  ...       ...         ...     ...       ...
257  17.0          8         305  130      3840          15   1980        US.
258  36.1          4          91   60      1800          16   1979     Japan.
259  22.0          6         232  112      2835          15   1983        US.
260  18.0          6         232  100      3288          16   1972        US.
261  22.0          6         250  105      3353          15   1977        US.

[262 rows x 8 columns]

##**Clean nan values**

For the following columns replace all empty/missing values with the requested value 

**clean the mpg field**

Create a function named clean_mpg
* replaces missing values with the median value

In [25]:
df.mpg.isna()

0       True
1      False
2      False
3      False
4      False
       ...
257    False
258    False
259    False
260    False
261    False
Name: mpg, Length: 262, dtype: bool

In [26]:
def clean_mpg(df):
  mask = df.mpg.isna()
  value = df.mpg.median()
  df['mpg'] = df.mpg.fillna(value)
  # print(mask)

  # # mask to select the rows where age is empty
  # mask = df.age.isna()

  # # calculate the mean (the replacement value)
  # replace_value = df.age.mean()
  
  # # fill those values with the value calculated
  # df['age_clean']= df[mask].age.fillna(replace_value)
  
  return df

clean_mpg(clean_columns(build_cars()))

      mpg  cylinders cubicinches   hp weightlbs  time-to-60    year     brand
0    22.0          4         NaN   69      2050           6   1985     Japan.
1    16.0          6         250  100      3278          18               US.
2    14.0          8         350  165      4209          12   1972        US.
3    31.9          4          89   71      1925          14   1980    Europe.
4    17.0          8         302  140      3449          11   1971        US.
..    ...        ...         ...  ...       ...         ...     ...       ...
257  17.0          8         305  130      3840          15   1980        US.
258  36.1          4          91   60      1800          16   1979     Japan.
259  22.0          6         232  112      2835          15   1983        US.
260  18.0          6         232  100      3288          16   1972        US.
261  22.0          6         250  105      3353          15   1977        US.

[262 rows x 8 columns]

**clean the time-to-60 field** 

Create a function named clean_t60
* replaces missing values with the median value

In [27]:
def clean_t60(df):
  value = df['time-to-60'].median()
  df['time-to-60'] = df['time-to-60'].fillna(value)
  return df

clean_t60(clean_mpg(clean_columns(build_cars())))

      mpg  cylinders cubicinches   hp weightlbs  time-to-60    year     brand
0    22.0          4         NaN   69      2050           6   1985     Japan.
1    16.0          6         250  100      3278          18               US.
2    14.0          8         350  165      4209          12   1972        US.
3    31.9          4          89   71      1925          14   1980    Europe.
4    17.0          8         302  140      3449          11   1971        US.
..    ...        ...         ...  ...       ...         ...     ...       ...
257  17.0          8         305  130      3840          15   1980        US.
258  36.1          4          91   60      1800          16   1979     Japan.
259  22.0          6         232  112      2835          15   1983        US.
260  18.0          6         232  100      3288          16   1972        US.
261  22.0          6         250  105      3353          15   1977        US.

[262 rows x 8 columns]

In [28]:
def pipeline(data, args):
	for arg in args:
		data = arg(data)
	return data

pipeline(None, [build_cars, clean_columns])

      mpg  cylinders cubicinches   hp weightlbs  time-to-60    year     brand
0     NaN          4         NaN   69      2050           6   1985     Japan.
1    16.0          6         250  100      3278          18               US.
2    14.0          8         350  165      4209          12   1972        US.
3    31.9          4          89   71      1925          14   1980    Europe.
4    17.0          8         302  140      3449          11   1971        US.
..    ...        ...         ...  ...       ...         ...     ...       ...
257  17.0          8         305  130      3840          15   1980        US.
258  36.1          4          91   60      1800          16   1979     Japan.
259  22.0          6         232  112      2835          15   1983        US.
260  18.0          6         232  100      3288          16   1972        US.
261  22.0          6         250  105      3353          15   1977        US.

[262 rows x 8 columns]

In [29]:
def add(*args):
	n = 0
	for arg in args:
		n += arg
	return n

add(*[1, 2, 3])

6

In [30]:
def recur_pipe(data=None, args=[], *ops):
	if callable(data):
		args = [data, args]
	if not ops == None:
		for op in ops:
			args.append(op)
	if args == []:
		return data
	else:
		if callable(args[0]):
			func = args[0]
			return recur_pipe(func(data), args[1:])
		elif isinstance(args[0], (list, tuple)):
			func = args[0][0]
			sub_args = args[0][1:]
			return recur_pipe(func(data, *sub_args), args[1:])


recur_pipe(None, [build_cars, clean_columns], clean_mpg, clean_t60)

      mpg  cylinders cubicinches   hp weightlbs  time-to-60    year     brand
0    22.0          4         NaN   69      2050           6   1985     Japan.
1    16.0          6         250  100      3278          18               US.
2    14.0          8         350  165      4209          12   1972        US.
3    31.9          4          89   71      1925          14   1980    Europe.
4    17.0          8         302  140      3449          11   1971        US.
..    ...        ...         ...  ...       ...         ...     ...       ...
257  17.0          8         305  130      3840          15   1980        US.
258  36.1          4          91   60      1800          16   1979     Japan.
259  22.0          6         232  112      2835          15   1983        US.
260  18.0          6         232  100      3288          16   1972        US.
261  22.0          6         250  105      3353          15   1977        US.

[262 rows x 8 columns]

In [31]:
recur_pipe(build_cars, clean_columns, clean_mpg, clean_t60)

      mpg  cylinders cubicinches   hp weightlbs  time-to-60    year     brand
0    22.0          4         NaN   69      2050           6   1985     Japan.
1    16.0          6         250  100      3278          18               US.
2    14.0          8         350  165      4209          12   1972        US.
3    31.9          4          89   71      1925          14   1980    Europe.
4    17.0          8         302  140      3449          11   1971        US.
..    ...        ...         ...  ...       ...         ...     ...       ...
257  17.0          8         305  130      3840          15   1980        US.
258  36.1          4          91   60      1800          16   1979     Japan.
259  22.0          6         232  112      2835          15   1983        US.
260  18.0          6         232  100      3288          16   1972        US.
261  22.0          6         250  105      3353          15   1977        US.

[262 rows x 8 columns]

**clean the year field**

Create a function named clean_year

* replaces missing values with the mode 
* converts the field to an integer value

In [46]:
def clean_year(df):
  value = df['year'].mode()[0]
  print(value)
  df['year'].replace(to_replace=[' ', '', 'NaN'], value=np.nan, inplace=True)
  df['year'] = df['year'].fillna(value)
  df['year'].astype(np.int64)
  return df

recur_pipe(build_cars, clean_columns, clean_mpg, clean_t60, clean_year)

 1974

      mpg  cylinders cubicinches   hp weightlbs  time-to-60    year     brand
0    22.0          4         NaN   69      2050           6   1985     Japan.
1    16.0          6         250  100      3278          18   1974        US.
2    14.0          8         350  165      4209          12   1972        US.
3    31.9          4          89   71      1925          14   1980    Europe.
4    17.0          8         302  140      3449          11   1971        US.
..    ...        ...         ...  ...       ...         ...     ...       ...
257  17.0          8         305  130      3840          15   1980        US.
258  36.1          4          91   60      1800          16   1979     Japan.
259  22.0          6         232  112      2835          15   1983        US.
260  18.0          6         232  100      3288          16   1972        US.
261  22.0          6         250  105      3353          15   1977        US.

[262 rows x 8 columns]

**clean the cubicinches field**

Create a function named clean_ci
* replaces missing values with the mode
* converts the field to an integer value by using the FunctionTransformer

In [33]:
# def string_to_float(v):
#   # v is an array of values
#   return v.astype(np.float)

# def clean_sid(df):

#   from sklearn.preprocessing import FunctionTransformer

#    # need to implement this function
#    # using the FunctionTransformer

#   mode = df['sid'].mode()[0]
#   df['sid'].fillna(mode, inplace=True)

#   transformer = FunctionTransformer(string_to_float)
#   df['sid'] = transformer.fit_transform(df['sid'].values)

#   return df

def clean_ci(df):
  from sklearn.preprocessing import FunctionTransformer

  df['cubicinches'].replace(to_replace=[' ', ''], value=np.nan, inplace=True)
  df['cubicinches'] = df['cubicinches'].fillna(df['cubicinches'].mode()[0])
  df['cubicinches'] = FunctionTransformer(lambda x: x.astype(np.int64)).fit_transform(df['cubicinches'].values)

  return df

recur_pipe(build_cars, clean_columns, clean_mpg, clean_t60, clean_year, clean_ci)

      mpg  cylinders  cubicinches   hp weightlbs  time-to-60    year     brand
0    22.0          4           97   69      2050           6   1985     Japan.
1    16.0          6          250  100      3278          18               US.
2    14.0          8          350  165      4209          12   1972        US.
3    31.9          4           89   71      1925          14   1980    Europe.
4    17.0          8          302  140      3449          11   1971        US.
..    ...        ...          ...  ...       ...         ...     ...       ...
257  17.0          8          305  130      3840          15   1980        US.
258  36.1          4           91   60      1800          16   1979     Japan.
259  22.0          6          232  112      2835          15   1983        US.
260  18.0          6          232  100      3288          16   1972        US.
261  22.0          6          250  105      3353          15   1977        US.

[262 rows x 8 columns]

**clean the weightlbs field**

Create a function named clean_wlb
* replaces missing values with the mean

In [34]:
from sklearn.preprocessing import FunctionTransformer

def clean_wlb(df):
  df['weightlbs'].replace(to_replace=[' ', ''], value=np.nan, inplace=True)
  df['weightlbs'] = FunctionTransformer(lambda x: x.astype(np.float128)).fit_transform(df['weightlbs'].values)
  df['weightlbs'].fillna(df['weightlbs'].mean(skipna=True), inplace=True)
  return df

# recur_pipe(build_cars, clean_columns, clean_mpg, clean_t60, clean_year, clean_ci, clean_wlb)
df = recur_pipe(build_cars, clean_columns, clean_mpg, clean_t60, clean_year, clean_ci, clean_wlb)
df

      mpg  cylinders  cubicinches   hp  weightlbs  time-to-60    year     brand
0    22.0          4           97   69     2050.0           6   1985     Japan.
1    16.0          6          250  100     3278.0          18               US.
2    14.0          8          350  165     4209.0          12   1972        US.
3    31.9          4           89   71     1925.0          14   1980    Europe.
4    17.0          8          302  140     3449.0          11   1971        US.
..    ...        ...          ...  ...        ...         ...     ...       ...
257  17.0          8          305  130     3840.0          15   1980        US.
258  36.1          4           91   60     1800.0          16   1979     Japan.
259  22.0          6          232  112     2835.0          15   1983        US.
260  18.0          6          232  100     3288.0          16   1972        US.
261  22.0          6          250  105     3353.0          15   1977        US.

[262 rows x 8 columns]

**clean the brand field**

Create a function named clean_brand
* remap this categorical field: 
* US becomes 0
* Europe becomes 1 
* Japan becomes 2
* place the new value in the field manf

In [35]:
def clean_spaces(df):
  return df.applymap(lambda x: x.strip() if isinstance(x, str) else x)

categories = {'US.': 0, 'Europe.': 1, 'Japan.': 2}

def clean_brand(df):
  df['manf'] = df['brand'].map(categories)
  return df

recur_pipe(build_cars, clean_columns, clean_spaces, clean_mpg, clean_t60, clean_year, clean_ci, clean_wlb, clean_brand)

      mpg  cylinders  cubicinches   hp  weightlbs  time-to-60  year    brand  manf
0    22.0          4           97   69     2050.0           6  1985   Japan.     2
1    16.0          6          250  100     3278.0          18            US.     0
2    14.0          8          350  165     4209.0          12  1972      US.     0
3    31.9          4           89   71     1925.0          14  1980  Europe.     1
4    17.0          8          302  140     3449.0          11  1971      US.     0
..    ...        ...          ...  ...        ...         ...   ...      ...   ...
257  17.0          8          305  130     3840.0          15  1980      US.     0
258  36.1          4           91   60     1800.0          16  1979   Japan.     2
259  22.0          6          232  112     2835.0          15  1983      US.     0
260  18.0          6          232  100     3288.0          16  1972      US.     0
261  22.0          6          250  105     3353.0          15  1977      US.     0

[262 rows x 9 columns]

###**Scaling Features**

Create a function named scale_features that transforms a list of column names to [0,1] using sklearn's min-max scaling.
* return a new dataframe with the scaled columns 

For example, this code

```
df_sub = scale_features(cars_df, ['mpg', 'hp])
print(df_sub.head())
```

would generate this output (before and after)

```
    mpg   hp
0  22.0   69
1  16.0  100
2  14.0  165
3  31.9   71
4  17.0  140
        mpg        hp
0  0.327869  0.125000
1  0.163934  0.293478
2  0.109290  0.646739
3  0.598361  0.135870
4  0.191257  0.510870
```

In [36]:
def scale_features(df, cols=['mpg', 'hp']):
  scaler = MinMaxScaler()
  for col in cols:
    df[col] = scaler.fit_transform(df[col].values.reshape(-1, 1))
  return df

recur_pipe(build_cars, clean_columns, clean_spaces, clean_mpg, clean_t60, clean_year, clean_ci, clean_wlb, clean_brand, (scale_features, ['mpg', 'hp']))

          mpg  cylinders  cubicinches        hp  weightlbs  time-to-60  year    brand  manf
0    0.327869          4           97  0.125000     2050.0           6  1985   Japan.     2
1    0.163934          6          250  0.293478     3278.0          18            US.     0
2    0.109290          8          350  0.646739     4209.0          12  1972      US.     0
3    0.598361          4           89  0.135870     1925.0          14  1980  Europe.     1
4    0.191257          8          302  0.510870     3449.0          11  1971      US.     0
..        ...        ...          ...       ...        ...         ...   ...      ...   ...
257  0.191257          8          305  0.456522     3840.0          15  1980      US.     0
258  0.713115          4           91  0.076087     1800.0          16  1979   Japan.     2
259  0.327869          6          232  0.358696     2835.0          15  1983      US.     0
260  0.218579          6          232  0.293478     3288.0          16  1972      US.     0
261  0.327869          6          250  0.320652     3353.0          15  1977      US.     0

[262 rows x 9 columns]

###**Flip Features**

For the 'time-to-60' a lower value is 'better'. We can remap this column so those cars with fast 'time-to-60' values (low numbers) are close to 1 and those with slow 'time-to-60' values (high numbers) are close to 0. We can simply invert these values.

Create a function called flip_features that takes a dataframe list of column names that inverts the values. For example, for the following code:

```
dfs = scale_features(dfc.copy(), ['time-to-60'])
print(dfs.head(5))
print(flip_features(dfs.copy(), ['time-to-60']).head(5))
```

The output would look like this:

```
   time-to-60  (OLD)
0    0.000000
1    0.631579
2    0.315789
3    0.421053
4    0.263158
   time-to-60  (Flipped)
0    1.000000
1    0.368421
2    0.684211
3    0.578947
4    0.736842
```

In [37]:
def flip_features(df, cols=['time-to-60']):
  df = scale_features(df, cols)
  for col in cols:
    df[col] = 1 - df[col]
  return df

the_final_data_is_here = recur_pipe(build_cars, clean_columns, clean_spaces, clean_mpg, clean_t60, clean_year, clean_ci, clean_wlb, clean_brand, (scale_features, ['mpg', 'hp']), (flip_features, ['time-to-60']))

the_final_data_is_here

          mpg  cylinders  cubicinches        hp  weightlbs  time-to-60  year    brand  manf
0    0.327869          4           97  0.125000     2050.0    1.000000  1985   Japan.     2
1    0.163934          6          250  0.293478     3278.0    0.368421            US.     0
2    0.109290          8          350  0.646739     4209.0    0.684211  1972      US.     0
3    0.598361          4           89  0.135870     1925.0    0.578947  1980  Europe.     1
4    0.191257          8          302  0.510870     3449.0    0.736842  1971      US.     0
..        ...        ...          ...       ...        ...         ...   ...      ...   ...
257  0.191257          8          305  0.456522     3840.0    0.526316  1980      US.     0
258  0.713115          4           91  0.076087     1800.0    0.473684  1979   Japan.     2
259  0.327869          6          232  0.358696     2835.0    0.526316  1983      US.     0
260  0.218579          6          232  0.293478     3288.0    0.473684  1972      US.     0
261  0.327869          6          250  0.320652     3353.0    0.526316  1977      US.     0

[262 rows x 9 columns]

**Steps to submit your work:**


1.   Download the notebook from Moodle. It is recommended that you use Google Colab to work on it.
2.   Upload any supporting files using file upload option within Google Colab.
3.   Complete the exercises and/or assignments
4.   Download as .ipynb
5.   Name the file as "lastname_firstname_WeekNumber.ipynb"
6.   After following the above steps, submit the final file in Moodle





<h1><center>The End!</center></h1>